#+OPTIONS: d:(not "BLOG")
#+EXCLUDE_TAGS: blog

#+BEGIN_SRC emacs-lisp :exports none
;; make org mode allow eval of some langs
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (haskell . t)
   (R . t)))
#+END_SRC

#+RESULTS:
: ((emacs-lisp . t) (python . t) (haskell . t) (R . t))

#+TITLE:     Bayesian Change Point Detection
#+AUTHOR:    Dominic Steinitz
#+EMAIL:     dominic@steinitz.org
#+DATE:      [2017-07-17 Mon]
#+DESCRIPTION: Bayesian change point analysis of UK / South Korea trade statistics
#+LANGUAGE:  en
#+BEAMER_THEME: Frankfurt [height=20pt]
#+OPTIONS:   H:3
#+LATEX_HEADER: \RequirePackage{fancyvrb}
#+LATEX_HEADER: \DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\scriptsize}


*** Python Diagnostics ADVI

#+BEGIN_SRC python :exports none :session py3-lr-session
from pymc3 import init_nuts

with chg_model:
  #MAP
  start_map, nuts_step = init_nuts(init='MAP')
  #ADVI
  start_advi, nuts_step = init_nuts(init='ADVI')
#+END_SRC

#+BEGIN_SRC python :exports both :session py3-lr-session
  pd.DataFrame(list(start_advi.items()))
#+END_SRC

#+RESULTS:
:         0          1
: 0   beta1   1.307549
: 1  alpha2   2.251540
: 2  alpha1   3.327910
: 3  sigma2   8.354255
: 4   beta2   1.512960
: 5     tau  73.073964
: 6  sigma1   6.992683

*** Python Diagnostics MAP

#+BEGIN_SRC python :exports both :session py3-lr-session
  pd.DataFrame(list(start_map.items()))
#+END_SRC

#+RESULTS:
:                 0                   1
: 0           beta1  0.9680002398415648
: 1          alpha2  -37.86057522849939
: 2          alpha1  10.729059293077137
: 3  tau_interval__                 0.0
: 4           beta2  1.9750114311467755
: 5    sigma2_log__  0.7086888732834176
: 6    sigma1_log__  0.8616867832117518

*** Where Precisely?

#+BEGIN_SRC R :exports none :session R-session
histData <- hist(extract(fitMCK)$tau,plot=FALSE,breaks=c(seq(0,length(yM)+1,1)))
histData$counts

min_indexes = which(diff(  sign(diff( c(0,histData$counts,0)))) == 2)
max_indexes = which(diff(  sign(diff( c(0,histData$counts,0)))) == -2)
modeData = data.frame(x=1:length(histData$counts),y=histData$counts)
min_locs = modeData[min_indexes,]
max_locs = modeData[max_indexes,]
png("diagrams/kr-cont-modes.png")
plot(modeData$y, type="l")
points( min_locs, col="red", pch=19, cex=1  )
points( max_locs, col="green", pch=19, cex=1  )
dev.off()
#+END_SRC

#+RESULTS:
: 2

#+BEGIN_SRC R :exports results :session R-session
  max_locs
#+END_SRC

#+RESULTS:
| 125 |  447 |
| 167 | 1051 |
| 226 |  490 |
| 230 |   88 |
| 233 |  190 |

